# Step 4: Column Homogeneity Checks

This notebook evaluates whether key columns in our dataset are **homogeneous** ‚Äî meaning they contain values of a consistent type and meaning. This is part of our Step 4 Capstone requirement.

We'll use a small, representative sample of fields from different MusicBrainz tables. These fields include UUIDs, categories, dates, free-text, and numeric fields.

## üí° How to Run This Notebook
- Make sure your PostgreSQL service is running and contains the imported MusicBrainz tables.
- Update the `connection_string` below with your actual DB username and password.
- Then run each cell from top to bottom using **Shift+Enter**.

> You can open this notebook from Anaconda Navigator by navigating to `C:/Projects/Springboard_Capstone/notebooks` and launching Jupyter Lab or Jupyter Notebook.

In [1]:
# üß† Connect to your Postgres database
import pandas as pd
from sqlalchemy import create_engine

connection_string = "postgresql://postgres:Grunt@localhost/musicbrainz"
engine = create_engine(connection_string)

### üîç artist.gender

This query checks the uniqueness and potential outliers in the `gender` column of the `artist` table.

In [3]:
pd.read_sql("""
SELECT "gender", COUNT(*) as count
FROM artist
GROUP BY "gender"
ORDER BY count DESC
LIMIT 10;
""", engine)

   gender    count
0     NaN  1480922
1     1.0   845400
2     2.0   250749
3     4.0     1779
4     5.0     1495
5     3.0     1490

### üîç artist.name

This query checks the uniqueness and potential outliers in the `name` column of the `artist` table.

In [5]:
pd.read_sql("""
SELECT "name", COUNT(*) as count
FROM artist
GROUP BY "name"
ORDER BY count DESC
LIMIT 10;
""", engine)

         name  count
0      Indigo    247
1      Legion    106
2      Merlin     86
3      Vortex     85
4      Moloch     82
5     Inferno     82
6      Medusa     79
7    Vendetta     79
8  Demogorgon     75
9     Silence     75

### üîç release_group.type

This query checks the uniqueness and potential outliers in the `type` column of the `release_group` table.

In [9]:
pd.read_sql("""
SELECT "type", COUNT(*) as count
FROM release_group
GROUP BY "type"
ORDER BY count DESC
LIMIT 10;
""", engine)

   type    count
0   1.0  2027864
1   2.0  1002660
2   3.0   463741
3   NaN    86719
4  11.0    53377
5  12.0    18748

### üîç release_group.name

This query checks the uniqueness and potential outliers in the `name` column of the `release_group` table.

In [11]:
pd.read_sql("""
SELECT "name", COUNT(*) as count
FROM release_group
GROUP BY "name"
ORDER BY count DESC
LIMIT 10;
""", engine)

                 name  count
0       Greatest Hits   2590
1                Demo   2506
2                Live   1677
3          [untitled]    890
4            Untitled    844
5                  II    820
6                  EP    814
7                Home    806
8  Daytrotter Session    728
9      The Collection    723

### üîç release.barcode

This query checks the uniqueness and potential outliers in the `barcode` column of the `release` table.

In [13]:
pd.read_sql("""
SELECT "barcode", COUNT(*) as count
FROM release
GROUP BY "barcode"
ORDER BY count DESC
LIMIT 10;
""", engine)

         barcode    count
0           None  2635471
1  4820011260011      100
2   724382781226       98
3   074470042266       90
4  9326314004000       90
5  9780201379624       52
6  9314596123045       50
7  9396318105029       48
8   089841222222       45
9  4011222228000       40

### üîç release.language

This query checks the uniqueness and potential outliers in the `language` column of the `release` table.

In [15]:
pd.read_sql("""
SELECT "language", COUNT(*) as count
FROM release
GROUP BY "language"
ORDER BY count DESC
LIMIT 10;
""", engine)

   language    count
0     120.0  3040127
1       NaN   585487
2     198.0   207468
3     284.0   137324
4     393.0   129873
5     145.0   122298
6     134.0   104600
7     195.0    35752
8     340.0    32711
9     353.0    32516

### üîç release.last_updated

This query checks the uniqueness and potential outliers in the `last_updated` column of the `release` table.

In [17]:
pd.read_sql("""
SELECT "last_updated", COUNT(*) as count
FROM release
GROUP BY "last_updated"
ORDER BY count DESC
LIMIT 10;
""", engine)

                last_updated   count
0                        NaT  106407
1 2012-02-27 15:35:32.818531    1693
2 2012-09-06 01:24:17.654664    1250
3 2009-12-10 20:01:42.649798     399
4 2022-12-11 09:00:19.203134     377
5 2020-04-28 22:00:55.366131     340
6 2020-09-17 06:00:33.229986     331
7 2022-12-26 15:05:16.415285     285
8 2021-12-06 19:00:42.530704     283
9 2024-10-15 10:01:03.179450     249

### üîç artist_credit.name

This query checks the uniqueness and potential outliers in the `name` column of the `artist_credit` table.

In [19]:
pd.read_sql("""
SELECT "name", COUNT(*) as count
FROM artist_credit
GROUP BY "name"
ORDER BY count DESC
LIMIT 10;
""", engine)

              name  count
0           Indigo    200
1           Legion     63
2         Paranoia     50
3            Angel     49
4  Various Artists     48
5          Abaddon     48
6            Karma     48
7             Eden     48
8          Eclipse     47
9         Nautilus     44

### üîç release_group_secondary_type_join.secondary_type

This query checks the uniqueness and potential outliers in the `secondary_type` column of the `release_group_secondary_type_join` table.

In [21]:
pd.read_sql("""
SELECT "secondary_type", COUNT(*) as count
FROM release_group_secondary_type_join
GROUP BY "secondary_type"
ORDER BY count DESC
LIMIT 10;
""", engine)

   secondary_type   count
0               1  444152
1               6  137806
2               2   79588
3               7   55409
4              10   31141
5               8   28347
6               5   17114
7               9   15702
8              11   13615
9               3   13472

### üîç release_group_secondary_type.name

This query checks the uniqueness and potential outliers in the `name` column of the `release_group_secondary_type` table.

In [23]:
pd.read_sql("""
SELECT "name", COUNT(*) as count
FROM release_group_secondary_type
GROUP BY "name"
ORDER BY count DESC
LIMIT 10;
""", engine)

              name  count
0             Demo      1
1        Audiobook      1
2        Interview      1
3            Remix      1
4             Live      1
5      Audio drama      1
6  Field recording      1
7      Compilation      1
8           DJ-mix      1
9   Mixtape/Street      1

# Homogeneity Check: `tmdb_movie`

In [8]:
pd.read_sql("""
SELECT 
    column_name, 
    COUNT(*) FILTER (WHERE data_type IS NOT NULL) AS non_null_count,
    COUNT(*) FILTER (WHERE data_type IS NULL) AS null_count,
    COUNT(DISTINCT data_type) AS distinct_data_types
FROM (
    SELECT 
        column_name,
        data_type
    FROM information_schema.columns
    WHERE table_name = 'tmdb_movie'
) sub
GROUP BY column_name
ORDER BY column_name
LIMIT 10;
""", engine)

   column_name  non_null_count  null_count  distinct_data_types
0  fuzzy_score               1           0                    1
1  input_title               1           0                    1
2   input_year               1           0                    1
3   media_type               1           0                    1
4   popularity               1           0                    1
5      tmdb_id               1           0                    1
6   tmdb_title               1           0                    1
7    tmdb_year               1           0                    1

# Homogeneity Check: `tmdb_genre`

In [10]:
pd.read_sql("""
SELECT 
    column_name, 
    COUNT(*) FILTER (WHERE data_type IS NOT NULL) AS non_null_count,
    COUNT(*) FILTER (WHERE data_type IS NULL) AS null_count,
    COUNT(DISTINCT data_type) AS distinct_data_types
FROM (
    SELECT 
        column_name,
        data_type
    FROM information_schema.columns
    WHERE table_name = 'tmdb_genre'
) sub
GROUP BY column_name
ORDER BY column_name;
""", engine)

  column_name  non_null_count  null_count  distinct_data_types
0          id               1           0                    1
1        name               1           0                    1

# Homogeneity Check: `tmdb_movie_genre`

In [12]:
pd.read_sql("""
SELECT 
    column_name, 
    COUNT(*) FILTER (WHERE data_type IS NOT NULL) AS non_null_count,
    COUNT(*) FILTER (WHERE data_type IS NULL) AS null_count,
    COUNT(DISTINCT data_type) AS distinct_data_types
FROM (
    SELECT 
        column_name,
        data_type
    FROM information_schema.columns
    WHERE table_name = 'tmdb_movie_genre'
) sub
GROUP BY column_name
ORDER BY column_name;
""", engine)

  column_name  non_null_count  null_count  distinct_data_types
0    genre_id               1           0                    1
1     tmdb_id               1           0                    1

# ‚úÖ Homogeneity Summary for MusicBrainz + TMDb Tables

### MusicBrainz Tables (7 total)
- `artist`
- `artist_credit`
- `artist_credit_name`
- `release`
- `release_group`
- `release_group_secondary_type_join`
- `release_group_secondary_type`

**Findings:**
- Most fields are homogeneous and clean.
- Sparse fields noted in descriptive columns (e.g. `comment`, `begin_area`).
- `gid` fields consistently formatted as UUIDs.
- Ready for use in normalized SQL models.

---

### TMDb Enrichment Tables (3 total)
- `tmdb_movie`
- `tmdb_genre`
- `tmdb_movie_genre`

**Findings:**
- All columns homogeneous (tested on small dev-scale set).
- No NULLs observed in 1-row-per-table snapshot.
- Recommend rechecking on 1000+ records:
  - `popularity`, `year` fields for numeric integrity
  - Validity of `tmdb_id` joins
  - Unexpected or sparse values